In [95]:
import pandas as pd

#1
d={'학번':[201524213,201621223,201621233,20161111,20172222],
    '이름':['오지환','박용택','정성훈','다니엘','지민'],
    '학과':['경영정보','경영정보','경영정보','컴퓨터공학','컴퓨터공학'],
    'Quiz':[15,20,10,17,18],
    '중간고사':[20,20,15,18,16]}
df=pd.DataFrame(d)
df

          학번   이름     학과  Quiz  중간고사
0  201524213  오지환   경영정보    15    20
1  201621223  박용택   경영정보    20    20
2  201621233  정성훈   경영정보    10    15
3   20161111  다니엘  컴퓨터공학    17    18
4   20172222   지민  컴퓨터공학    18    16

In [15]:
#2
df[['학번','중간고사']]

          학번  중간고사
0  201524213    20
1  201621223    20
2  201621233    15
3   20161111    18
4   20172222    16

In [97]:
#3
dfr=df.reindex([2, 0, 4, 1, 3])
dfr

          학번   이름     학과  Quiz  중간고사
2  201621233  정성훈   경영정보    10    15
0  201524213  오지환   경영정보    15    20
4   20172222   지민  컴퓨터공학    18    16
1  201621223  박용택   경영정보    20    20
3   20161111  다니엘  컴퓨터공학    17    18

In [31]:
#4-1
dfr.iloc[1]

학번      201524213
이름            오지환
학과           경영정보
퀴즈             15
중간고사           20
Name: 0, dtype: object

In [33]:
#4-2
dfr.loc[dfr['이름']=='박용택']

          학번   이름    학과  퀴즈  중간고사
1  201621223  박용택  경영정보  20    20

In [75]:
#5-1
dfr.iloc[:,1:5:3]

    이름  중간고사
2  정성훈    15
0  오지환    20
4   지민    16
1  박용택    20
3  다니엘    18

In [63]:
#5-2
dfr.loc[:,['이름','중간고사']]

    이름  중간고사
2  정성훈    15
0  오지환    20
4   지민    16
1  박용택    20
3  다니엘    18

In [41]:
#6
dfr['중간고사'].mean()

17.8

In [83]:
#7
dfr.iloc[dfr['중간고사'].argmin()]

학번      201621233
이름            정성훈
학과           경영정보
퀴즈             10
중간고사           15
Name: 2, dtype: object

In [99]:
#8
dfr.loc[dfr['Quiz'].idxmax()]

학번      201621223
이름            박용택
학과           경영정보
Quiz           20
중간고사           20
Name: 1, dtype: object

In [133]:
#9
dfr.describe()

                 학번       Quiz       중간고사
count  5.000000e+00   5.000000   5.000000
mean   1.290200e+08  16.000000  17.800000
std    9.936905e+07   3.807887   2.280351
min    2.016111e+07  10.000000  15.000000
25%    2.017222e+07  15.000000  16.000000
50%    2.015242e+08  17.000000  18.000000
75%    2.016212e+08  18.000000  20.000000
max    2.016212e+08  20.000000  20.000000

In [109]:
#10
dfr2=dfr.sort_values('중간고사',ascending=False)
dfr2

          학번   이름     학과  Quiz  중간고사
0  201524213  오지환   경영정보    15    20
1  201621223  박용택   경영정보    20    20
3   20161111  다니엘  컴퓨터공학    17    18
4   20172222   지민  컴퓨터공학    18    16
2  201621233  정성훈   경영정보    10    15

In [111]:
#11
dfr[dfr['중간고사'] > dfr['중간고사'].mean()]

          학번   이름     학과  Quiz  중간고사
0  201524213  오지환   경영정보    15    20
1  201621223  박용택   경영정보    20    20
3   20161111  다니엘  컴퓨터공학    17    18

In [119]:
#12
dfr[(dfr['중간고사'] > dfr['중간고사'].mean()) & (dfr['Quiz'] > dfr['Quiz'].mean())]

          학번   이름     학과  Quiz  중간고사
1  201621223  박용택   경영정보    20    20
3   20161111  다니엘  컴퓨터공학    17    18

In [127]:
#13
dfr.groupby('학과')['학과'].value_counts()

학과
경영정보     3
컴퓨터공학    2
Name: count, dtype: int64

In [131]:
#14
dfr.groupby('학과')['중간고사'].mean()

학과
경영정보     18.333333
컴퓨터공학    17.000000
Name: 중간고사, dtype: float64